tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "michaeleisel/zld"
brew "giflib"
brew "libpng"
brew "openssl@1.1"
brew "python@3.10"
brew "autojump"
brew "gettext"
brew "pcre2"
brew "pkg-config"
brew "pixman"
brew "cairo"
brew "cmake"
brew "php"
brew "composer"
brew "erlang"
brew "fish"
brew "gh"
brew "git"
brew "gnu-sed"
brew "openjdk"
brew "h2"
brew "jenv"
brew "jpeg", link: true
brew "lazygit"
brew "libevent"
brew "libfido2"
brew "pango"
brew "librsvg"
brew "mysql"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "python@3.11"
brew "neovim-remote"
brew "node"
brew "nvm"
brew "postgresql@14"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "amethyst"
cask "arc"
cask "aws-vault"
cask "docker"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "gitkraken"
cask "iterm2"
cask "karabiner-elements"
cask "postman"
cask "stats"
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "asvetliakov.vscode-neovim"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "DanielSanMedium.dscodegpt"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "icrawl.discord-vscode"
vscode "Jaakko.black"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mcagampan.dark-horizon"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "styled-components.vscode-styled-components"
vscode "tetradresearch.vscode-h2o"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "william-voyek.vscode-nginx"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
