tap "adoptopenjdk/openjdk"
tap "filosottile/musl-cross"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "michaeleisel/zld"
brew "openssl@1.1"
brew "openssl@3"
brew "python@3.10"
brew "autojump"
brew "bat"
brew "bottom"
brew "libpng"
brew "gettext"
brew "pcre2"
brew "pixman"
brew "cairo"
brew "cmake"
brew "curl"
brew "dive"
brew "erlang"
brew "eza"
brew "fd"
brew "fish"
brew "gh"
brew "giflib"
brew "git"
brew "gnu-sed"
brew "go"
brew "jenv"
brew "jpeg"
brew "just"
brew "lazygit"
brew "libevent"
brew "libfido2"
brew "pango"
brew "librsvg"
brew "mysql"
brew "navi"
brew "neofetch"
brew "ninja"
brew "node"
brew "nvm"
brew "pkg-config"
brew "pyenv"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rustup-init"
brew "sccache"
brew "starship"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "wget"
brew "yarn"
brew "zoxide"
brew "filosottile/musl-cross/musl-cross"
brew "jesseduffield/lazydocker/lazydocker"
brew "michaeleisel/zld/zld"
cask "amethyst"
cask "arc"
cask "aws-vault"
cask "docker"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "gitkraken"
cask "iterm2"
cask "notion"
cask "obsidian"
cask "postman"
cask "stats"
cask "visual-studio-code"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "asvetliakov.vscode-neovim"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "icrawl.discord-vscode"
vscode "jaakko.black"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "styled-components.vscode-styled-components"
vscode "tetradresearch.vscode-h2o"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "william-voyek.vscode-nginx"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
