tap "filosottile/musl-cross"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
brew "openssl@1.1"
brew "openssl@3"
brew "python@3.10"
brew "autojump"
brew "bat"
brew "bottom"
brew "libpng"
brew "gettext"
brew "pcre2"
brew "pixman"
brew "cairo"
brew "cmake"
brew "curl"
brew "dive"
brew "erlang"
brew "eza"
brew "fd"
brew "fish"
brew "gh"
brew "giflib"
brew "git"
brew "gnu-sed"
brew "go"
brew "jenv"
brew "jpeg"
brew "just"
brew "lazygit"
brew "libevent"
brew "libfido2"
brew "pango"
brew "librsvg"
brew "mysql"
brew "navi"
brew "neofetch"
brew "ninja"
brew "node"
brew "nvm"
brew "pkg-config"
brew "pyenv"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rustup-init"
brew "sccache"
brew "starship"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "wget"
brew "yarn"
brew "zoxide"
brew "filosottile/musl-cross/musl-cross"
brew "jesseduffield/lazydocker/lazydocker"
cask "amethyst"
cask "arc"
cask "aws-vault"
cask "docker"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "gitkraken"
cask "iterm2"
cask "notion"
cask "obsidian"
cask "postman"
cask "stats"
cask "visual-studio-code"
cask "wezterm"
